In [2]:
"""It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:"""

'It happens all the time: someone gives you data containing malformed strings,\nPython, lists and missing data. How do you tidy it up so you can get on with the\nanalysis?\nTake this monstrosity as the DataFrame to use in the following puzzles:'

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

"""for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber']=df.FlightNumber.loc[i-1]+10
df['FlightNumber']
df"""
#df.fillna(0)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
# converting 'FlightNumber' from float to int 
df['FlightNumber'] = df['FlightNumber'].astype(int) 
df

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [7]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
"""
data = df.copy()
data

data[['From','To']]=data.From_To.str.split('_',expand=True)
data

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

In [8]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
"""

data.From = data.From.str.capitalize()
data.To = data.To.str.capitalize()
data.From_To = data.From_To.str.capitalize()

data

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,Madrid_milan,NaN,[],<Air France> (12),Madrid,Milan
2,London_stockholm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_paris,NaN,[13],12. Air France,Budapest,Paris
4,Brussels_london,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [9]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions."""
df
df.drop(['From_To'], axis = 1) 

df['From_To']=data['From_To']
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris       10045.0      [23, 47]               KLM(!)
1      Madrid_milan           NaN            []    <Air France> (12)
2  London_stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_paris           NaN          [13]       12. Air France
4   Brussels_london       10085.0      [67, 32]          "Swiss Air"

In [11]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""

df 
rows = []
_ = df.apply(lambda row:[rows.append([row['Airline'],row['FlightNumber'],nn,row['From_To']])
    for nn in row.RecentDelays],axis=1)
rows

[['KLM(!)', 10045.0, 23, 'London_paris'],
 ['KLM(!)', 10045.0, 47, 'London_paris'],
 ['(British Airways. )', 10065.0, 24, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 43, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 87, 'London_stockholm'],
 ['12. Air France', nan, 13, 'Budapest_paris'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_london'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_london']]

In [12]:
df_new = pd.DataFrame(rows,columns=df.columns)
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris       10045.0      [23, 47]               KLM(!)
1      Madrid_milan           NaN            []    <Air France> (12)
2  London_stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_paris           NaN          [13]       12. Air France
4   Brussels_london       10085.0      [67, 32]          "Swiss Air"

In [13]:
df_new

               From_To  FlightNumber  RecentDelays           Airline
0               KLM(!)       10045.0            23      London_paris
1               KLM(!)       10045.0            47      London_paris
2  (British Airways. )       10065.0            24  London_stockholm
3  (British Airways. )       10065.0            43  London_stockholm
4  (British Airways. )       10065.0            87  London_stockholm
5       12. Air France           NaN            13    Budapest_paris
6          "Swiss Air"       10085.0            67   Brussels_london
7          "Swiss Air"       10085.0            32   Brussels_london

In [14]:
"""Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [15]:
length_cols = df3.shape[1]
length_cols

3

In [16]:
df3.columns[0]

0